TzionCastillo1/sk1pper_fsw/Drivers/BSP/STM32f405_SpeedyBee/stm32f405_SpeedyBee.h
#ifndef __STM32F405_SPEEDYBEE_H
#define __STM32F405_SPEEDYBEE_H

#ifdef __cplusplus
extern "C" {
#endif

#include "stm32f4xx_hal.h"

#include "hw_config.h"
#include "servo.h"
#include "i2c.h"
#include "usart.h"
#include "spi.h"
#include "gpio.h"
#include "tim.h"
#include "adc.h"
#include "dma.h"
#include "errors.h"

#if !defined(USE_STM32F405_SPEEDYBEE)
#define USE_STM32F405_SPEEDYBEE
#endif

extern uint32_t SystemCoreClock;          /*!< System Clock Frequency (Core Clock) */
#define PWMCORECLOCK 160000000

#define PRINTF_UART_TIMEOUT_MS 10

/** @defgroup STM32F405_SPEEDYBEE_Exported_Types
 * @{
 */
typedef enum
{
    LED2 = 0,
    LED_GREEN = LED2,
    LED_BLUE,
    LEDn
} Led_t;

 /** @}
 */


extern void putchar_(char c);

void BSP_LED_Init(Led_t Led);

void BSP_Led_DeInit(Led_t Led);

void BSP_LED_On(Led_t Led);

void BSP_LED_Off(Led_t Led);

void BSP_LED_Toggle(Led_t Led);

error_t BSP_link_mgr_tx_func(char *data, uint16_t len);

#ifdef __cplusplus
}
#endif


#endif /* __STM32F405_SPEEDYBEE_H */